ductuanhoang/Flyx_Nrf_dongle/Board_Project/Flyx_CppTest.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32L1
ProjectManager.MainLocation=Core/Src
PA6.Mode=Full_Duplex_Master
PH0-OSC_IN.Signal=RCC_OSC_IN
USART2.IPParameters=VirtualMode,BaudRate
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32L151CBTxA
Dma.ADC.0.Mode=DMA_NORMAL
SPI1.VirtualType=VM_MASTER
SPI2.VirtualType=VM_MASTER
ADC.Rank-0\#ChannelRegularConversion=1
RCC.PLLCLKFreq_Value=32000000
PB6.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_RISING
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_USART1_UART_Init-USART1-false-HAL-true,5-MX_USART2_UART_Init-USART2-false-HAL-true,6-MX_ADC_Init-ADC-false-HAL-true,7-MX_SPI1_Init-SPI1-false-HAL-true,8-MX_SPI2_Init-SPI2-false-HAL-true,9-MX_TIM3_Init-TIM3-false-HAL-true,10-MX_TIM6_Init-TIM6-false-HAL-true
Dma.ADC.0.Priority=DMA_PRIORITY_LOW
ADC.ScanConvMode=ADC_SCAN_ENABLE
RCC.RTCFreq_Value=37000
PB6.GPIO_Label=RPM_SENSOR
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false
USART1.IPParameters=VirtualMode
PB15.Signal=SPI2_MOSI
PB13.Signal=SPI2_SCK
PinOutPanel.RotationAngle=0
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
VP_FREERTOS_VS_CMSIS_V2.Mode=CMSIS_V2
Mcu.IP4=RCC
ADC.NbrOfConversion=4
ADC.DiscontinuousConvMode=DISABLE
RCC.FCLKCortexFreq_Value=32000000
Mcu.IP5=SPI1
Mcu.IP2=FREERTOS
Mcu.IP3=NVIC
Mcu.IP0=ADC
Mcu.IP1=DMA
Mcu.UserConstants=
Mcu.ThirdPartyNb=0
Dma.ADC.0.PeriphInc=DMA_PINC_DISABLE
SPI1.Direction=SPI_DIRECTION_2LINES
RCC.HCLKFreq_Value=32000000
Mcu.IPNb=12
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=32000000
TIM3.Period=100-1
PB6.Signal=GPXTI6
PB12.PinState=GPIO_PIN_SET
SPI1.CalculateBaudRate=16.0 MBits/s
Mcu.Pin6=PA5
Mcu.Pin7=PA6
Mcu.Pin8=PA7
Mcu.Pin9=PB0
FREERTOS.IPParameters=Tasks01,FootprintOK
ADC.Rank-6\#ChannelRegularConversion=4
RCC.AHBFreq_Value=32000000
PH0-OSC_IN.Mode=HSE-External-Oscillator
Mcu.Pin0=PH0-OSC_IN
Mcu.Pin1=PH1-OSC_OUT
Dma.ADC.0.Direction=DMA_PERIPH_TO_MEMORY
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PA0-WKUP1
Mcu.Pin3=PA1
Mcu.Pin4=PA2
Mcu.Pin5=PA3
ADC.Rank-5\#ChannelRegularConversion=3
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=16000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PB2.Signal=GPIO_Output
PB12.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
Mcu.IP10=USART1
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:true\:true\:false\:true
RCC.PLLMUL=RCC_PLL_MUL4
Mcu.IP11=USART2
PB12.GPIO_Label=SPI2_CS
ProjectManager.FirmwarePackage=STM32Cube FW_L1 V1.10.2
MxDb.Version=DB.6.0.20
ProjectManager.BackupPrevious=false
RCC.VCOInputFreq_Value=16000000
PB14.Mode=Full_Duplex_Master
TIM3.Prescaler=3200-1
File.Version=6
SPI2.CalculateBaudRate=16.0 MBits/s
PB7.Signal=GPIO_Input
PB8.Locked=true
PB6.Locked=true
NVIC.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
TIM6.Period=100-1
Dma.RequestsNb=1
PB6.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultEXTI
ProjectManager.HalAssertFull=false
PB0.Locked=true
ProjectManager.ProjectName=Flyx_CppTest
Dma.ADC.0.MemInc=DMA_MINC_ENABLE
PB7.GPIO_Label=BLE_STTT
PH1-OSC_OUT.Mode=HSE-External-Oscillator
PB9.Signal=GPIO_Output
Mcu.Package=LQFP48
PA6.Signal=SPI1_MISO
PB1.Signal=ADC_IN9
SPI2.Mode=SPI_MODE_MASTER
ADC.SamplingTime-5\#ChannelRegularConversion=ADC_SAMPLETIME_4CYCLES
USART2.VirtualMode=VM_ASYNC
ProjectManager.ToolChainLocation=
Dma.ADC.0.Instance=DMA1_Channel1
RCC.LSI_VALUE=37000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PA10.Signal=USART1_RX
PB9.GPIO_PuPd=GPIO_PULLUP
ADC.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_0
FREERTOS.FootprintOK=true
Dma.ADC.0.MemDataAlignment=DMA_MDATAALIGN_HALFWORD
RCC.APB1TimFreq_Value=32000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
SPI2.Direction=SPI_DIRECTION_2LINES
PB13.Mode=Full_Duplex_Master
ADC.Channel-4\#ChannelRegularConversion=ADC_CHANNEL_1
NVIC.USART1_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
Dma.Request0=ADC
ADC.ExternalTrigConv=ADC_EXTERNALTRIGCONV_T3_TRGO
ProjectManager.CustomerFirmwarePackage=
ADC.Channel-6\#ChannelRegularConversion=ADC_CHANNEL_9
PA3.Signal=USART2_RX
PA5.Mode=Full_Duplex_Master
RCC.TIMFreq_Value=32000000
RCC.MSI_VALUE=2097000
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
ADC.SamplingTime-6\#ChannelRegularConversion=ADC_SAMPLETIME_4CYCLES
ProjectManager.ProjectFileName=Flyx_CppTest.ioc
FREERTOS.Tasks01=defaultTask,24,256,StartDefaultTask,Default,NULL,Dynamic,NULL,NULL
PB8.GPIOParameters=GPIO_Label
PA7.Mode=Full_Duplex_Master
TIM3.Channel-Output\ Compare1\ No\ Output=TIM_CHANNEL_1
PB9.GPIO_Label=BLE_RST
Mcu.PinsNb=26
PA10.Mode=Asynchronous
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate
NVIC.SavedSvcallIrqHandlerGenerated=true
PB6.GPIO_PuPd=GPIO_PULLUP
TIM6.Prescaler=320-1
VP_TIM6_VS_ClockSourceINT.Mode=Enable_Timer
ProjectManager.DefaultFWLocation=true
ADC.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,NbrOfConversionFlag,NbrOfConversion,ExternalTrigConv,ClockPrescaler,DMAContinuousRequests,ScanConvMode,DiscontinuousConvMode,ContinuousConvMode,Rank-4\#ChannelRegularConversion,Channel-4\#ChannelRegularConversion,SamplingTime-4\#ChannelRegularConversion,Rank-5\#ChannelRegularConversion,Channel-5\#ChannelRegularConversion,SamplingTime-5\#ChannelRegularConversion,Rank-6\#ChannelRegularConversion,Channel-6\#ChannelRegularConversion,SamplingTime-6\#ChannelRegularConversion
PB12.Locked=true
ProjectManager.DeletePrevious=true
RCC.TimerFreq_Value=32000000
ADC.ClockPrescaler=ADC_CLOCK_ASYNC_DIV4
NVIC.USART2_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
USART2.BaudRate=115200
RCC.FamilyName=M
Dma.ADC.0.PeriphDataAlignment=DMA_PDATAALIGN_HALFWORD
NVIC.TIM6_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
PB9.GPIOParameters=PinState,GPIO_PuPd,GPIO_Label
SH.GPXTI6.0=GPIO_EXTI6
VP_TIM6_VS_ClockSourceINT.Signal=TIM6_VS_ClockSourceINT
PA3.Mode=Asynchronous
SH.GPXTI6.ConfNb=1
TIM6.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_DISABLE
PB8.GPIO_Label=BLE_TRANS_MODE
PA9.Mode=Asynchronous
TIM6.IPParameters=Prescaler,Period,AutoReloadPreload
ProjectManager.TargetToolchain=STM32CubeIDE
VP_TIM3_VS_no_output1.Signal=TIM3_VS_no_output1
PB7.GPIOParameters=GPIO_Label
PA9.Signal=USART1_TX
PB2.GPIOParameters=GPIO_Label
PA0-WKUP1.Signal=ADC_IN0
PB9.Locked=true
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate
ADC.NbrOfConversionFlag=1
ProjectManager.RegisterCallBack=
RCC.LSE_VALUE=32768
PA1.Signal=ADC_IN1
PB1.Locked=true
PB14.Signal=SPI2_MISO
PA5.Signal=SPI1_SCK
ADC.DMAContinuousRequests=ENABLE
RCC.MCOPinFreq_Value=32000000
PB0.Mode=IN8
board=custom
VP_TIM3_VS_no_output1.Mode=Output Compare1 No Output
ADC.Rank-4\#ChannelRegularConversion=2
RCC.VCOOutputFreq_Value=64000000
ProjectManager.LastFirmware=true
PB15.Mode=Full_Duplex_Master
Dma.ADC.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority
NVIC.SavedSystickIrqHandlerGenerated=true
RCC.APB2Freq_Value=32000000
PA1.Mode=IN1
MxCube.Version=6.2.0
SPI1.Mode=SPI_MODE_MASTER
ADC.SamplingTime-4\#ChannelRegularConversion=ADC_SAMPLETIME_4CYCLES
VP_SYS_VS_Systick.Mode=SysTick
TIM3.IPParameters=Channel-Output Compare1 No Output,Prescaler,Period,TIM_MasterOutputTrigger
PH1-OSC_OUT.Signal=RCC_OSC_OUT
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PA0-WKUP1.Mode=IN0
ProjectManager.FreePins=false
RCC.IPParameters=48MHZClocksFreq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,LSE_VALUE,LSI_VALUE,MCOPinFreq_Value,MSI_VALUE,PLLCLKFreq_Value,PLLMUL,PLLSourceVirtual,PWRFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,TIMFreq_Value,TimerFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32L151C(6-8-B)TxA
NVIC.SavedPendsvIrqHandlerGenerated=true
RCC.RTCHSEDivFreq_Value=8000000
PA2.Signal=USART2_TX
Mcu.Pin24=VP_TIM3_VS_no_output1
ProjectManager.UnderRoot=true
Mcu.Pin25=VP_TIM6_VS_ClockSourceINT
PB2.Locked=true
Mcu.IP8=TIM3
VP_FREERTOS_VS_CMSIS_V2.Signal=FREERTOS_VS_CMSIS_V2
Mcu.IP9=TIM6
Mcu.IP6=SPI2
Mcu.IP7=SYS
ProjectManager.CoupleFile=false
RCC.48MHZClocksFreq_Value=32000000
RCC.SYSCLKFreq_VALUE=32000000
Mcu.Pin22=VP_FREERTOS_VS_CMSIS_V2
Mcu.Pin23=VP_SYS_VS_Systick
PA1.Locked=true
Mcu.Pin20=PB8
Mcu.Pin21=PB9
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
USART1.VirtualMode=VM_ASYNC
ProjectManager.CompilerOptimize=6
PB9.PinState=GPIO_PIN_SET
NVIC.EXTI9_5_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
PB2.GPIO_Label=KNOCK_HOLD
ProjectManager.HeapSize=0x200
Mcu.Pin15=PB15
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PB1.Mode=IN9
Mcu.Pin16=PA9
Mcu.Pin13=PB13
Mcu.Pin14=PB14
Mcu.Pin19=PB7
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PA10
RCC.HSI_VALUE=16000000
Mcu.Pin18=PB6
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PB2
Mcu.Pin12=PB12
Mcu.Pin10=PB1
PB7.Locked=true
PA2.Mode=Asynchronous
PB8.Signal=GPIO_Output
RCC.PWRFreq_Value=32000000
ADC.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_4CYCLES
ADC.Channel-5\#ChannelRegularConversion=ADC_CHANNEL_8
NVIC.DMA1_Channel1_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
TIM3.TIM_MasterOutputTrigger=TIM_TRGO_UPDATE
PB12.GPIO_PuPd=GPIO_PULLUP
RCC.APB1Freq_Value=32000000
PB0.Signal=ADC_IN8
ADC.ContinuousConvMode=DISABLE
ProjectManager.DeviceId=STM32L151CBTxA
PB12.GPIOParameters=PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PB12.Signal=GPIO_Output
ProjectManager.LibraryCopy=1
PA7.Signal=SPI1_MOSI
isbadioc=false
